cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55G.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CMCC</name>
         <version>11108F</version>
         <description>Cortex-M Cache Controller</description>
         <groupName>CMCC</groupName>
         <prependToName>CMCC_</prependToName>
         <baseAddress>0x4003C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CMCC_TYPE</name>
               <description>Cache Controller Type Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>AP</name>
                     <description>Access Port Access Allowed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCLK</name>
                     <description>Dynamic Clock Gating Supported</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RANDP</name>
                     <description>Random Selection Policy Supported</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LRUP</name>
                     <description>Least Recently Used Policy Supported</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RRP</name>
                     <description>Random Selection Policy Supported</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAYNUM</name>
                     <description>Number of Ways</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>WAYNUMSelect</name>
                        <enumeratedValue>
                           <name>DMAPPED</name>
                           <description>Direct Mapped Cache</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARCH2WAY</name>
                           <description>2-way set associative</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARCH4WAY</name>
                           <description>4-way set associative</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARCH8WAY</name>
                           <description>8-way set associative</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LCKDOWN</name>
                     <description>Lockdown Supported</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSIZE</name>
                     <description>Data Cache Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CSIZESelect</name>
                        <enumeratedValue>
                           <name>CSIZE_1KB</name>
                           <description>Data cache size is 1 Kbyte</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CSIZE_2KB</name>
                           <description>Data cache size is 2 Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CSIZE_4KB</name>
                           <description>Data cache size is 4 Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CSIZE_8KB</name>
                           <description>Data cache size is 8 Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLSIZE</name>
                     <description>Cache LIne Size</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CLSIZESelect</name>
                        <enumeratedValue>
                           <name>CLSIZE_1KB</name>
                           <description>Cache line size is 4 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLSIZE_2KB</name>
                           <description>Cache line size is 8 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLSIZE_4KB</name>
                           <description>Cache line size is 16 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLSIZE_8KB</name>
                           <description>Cache line size is 32 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_CFG</name>
               <description>Cache Controller Configuration Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GCLKDIS</name>
                     <description>Disable Clock Gating</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICDIS</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDIS</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRGCSIZE</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_CTRL</name>
               <description>Cache Controller Control Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CEN</name>
                     <description>Cache Controller Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_SR</name>
               <description>Cache Controller Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CSTS</name>
                     <description>Cache Controller Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_MAINT0</name>
               <description>Cache Controller Maintenance Register 0</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INVALL</name>
                     <description>Cache Controller Invalidate All</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_MAINT1</name>
               <description>Cache Controller Maintenance Register 1</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INDEX</name>
                     <description>Invalidate Index</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>WAY</name>
                     <description>Invalidate Way</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>WAYSelect</name>
                        <enumeratedValue>
                           <name>WAY0</name>
                           <description>Way 0 is selection for index invalidation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAY1</name>
                           <description>Way 1 is selection for index invalidation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAY2</name>
                           <description>Way 2 is selection for index invalidation</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAY3</name>
                           <description>Way 3 is selection for index invalidation</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_MCFG</name>
               <description>Cache Controller Monitor Configuration Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Cache Controller Monitor Counter Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>CYCLE_COUNT</name>
                           <description>Cycle counter</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IHIT_COUNT</name>
                           <description>Instruction hit counter</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DHIT_COUNT</name>
                           <description>Data hit counter</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_MEN</name>
               <description>Cache Controller Monitor Enable Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MENABLE</name>
                     <description>Cache Controller Monitor Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_MCTRL</name>
               <description>Cache Controller Monitor Control Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Monitor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMCC_MSR</name>
               <description>Cache Controller Monitor Status Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EVENT_CNT</name>
                     <description>Monitor Event Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
