cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55G.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="USART0">
         <name>USART1</name>
         <baseAddress>0x40020200</baseAddress>
      </peripheral>
      <peripheral derivedFrom="USART0">
         <name>USART2</name>
         <baseAddress>0x40024200</baseAddress>
      </peripheral>
      <peripheral derivedFrom="USART0">
         <name>USART3</name>
         <baseAddress>0x40018200</baseAddress>
      </peripheral>
      <peripheral derivedFrom="USART0">
         <name>USART4</name>
         <baseAddress>0x4001C200</baseAddress>
      </peripheral>
      <peripheral derivedFrom="USART0">
         <name>USART5</name>
         <baseAddress>0x40008200</baseAddress>
      </peripheral>
      <peripheral derivedFrom="USART0">
         <name>USART6</name>
         <baseAddress>0x40040200</baseAddress>
      </peripheral>
      <peripheral>
         <name>WDT</name>
         <version>6080H</version>
         <description>Watchdog Timer</description>
         <groupName>WDT</groupName>
         <prependToName>WDT_</prependToName>
         <baseAddress>0x400E1450</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>WDT</name>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>WDT_CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>WDRSTT</name>
                     <description>Watchdog Restart</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT_MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WDV</name>
                     <description>Watchdog Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>WDFIEN</name>
                     <description>Watchdog Fault Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDRSTEN</name>
                     <description>Watchdog Reset Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDRPROC</name>
                     <description>Watchdog Reset Processor</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDDIS</name>
                     <description>Watchdog Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDD</name>
                     <description>Watchdog Delta Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>WDDBGHLT</name>
                     <description>Watchdog Debug Halt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDIDLEHLT</name>
                     <description>Watchdog Idle Halt</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT_SR</name>
               <description>Status Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WDUNF</name>
                     <description>Watchdog Underflow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDERR</name>
                     <description>Watchdog Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>LOCKBIT</name>
         <groupName>LOCKBIT</groupName>
         <prependToName>LOCKBIT_</prependToName>
         <baseAddress>0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>LOCKBIT_WORD0</name>
               <description>Lock Bits Word 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOCK_REGION_0</name>
                     <description>Lock Region 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_1</name>
                     <description>Lock Region 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_2</name>
                     <description>Lock Region 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_3</name>
                     <description>Lock Region 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_4</name>
                     <description>Lock Region 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_5</name>
                     <description>Lock Region 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_6</name>
                     <description>Lock Region 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_7</name>
                     <description>Lock Region 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_8</name>
                     <description>Lock Region 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_9</name>
                     <description>Lock Region 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_10</name>
                     <description>Lock Region 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_11</name>
                     <description>Lock Region 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_12</name>
                     <description>Lock Region 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_13</name>
                     <description>Lock Region 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_14</name>
                     <description>Lock Region 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_15</name>
                     <description>Lock Region 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_16</name>
                     <description>Lock Region 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_17</name>
                     <description>Lock Region 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_18</name>
                     <description>Lock Region 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_19</name>
                     <description>Lock Region 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_20</name>
                     <description>Lock Region 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_21</name>
                     <description>Lock Region 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_22</name>
                     <description>Lock Region 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_23</name>
                     <description>Lock Region 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_24</name>
                     <description>Lock Region 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_25</name>
                     <description>Lock Region 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_26</name>
                     <description>Lock Region 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_27</name>
                     <description>Lock Region 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_28</name>
                     <description>Lock Region 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_29</name>
                     <description>Lock Region 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_30</name>
                     <description>Lock Region 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_31</name>
                     <description>Lock Region 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCKBIT_WORD1</name>
               <description>Lock Bits Word 1</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOCK_REGION_32</name>
                     <description>Lock Region 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_33</name>
                     <description>Lock Region 33</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_34</name>
                     <description>Lock Region 34</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_35</name>
                     <description>Lock Region 35</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_36</name>
                     <description>Lock Region 36</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_37</name>
                     <description>Lock Region 37</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_38</name>
                     <description>Lock Region 38</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_39</name>
                     <description>Lock Region 39</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_40</name>
                     <description>Lock Region 40</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_41</name>
                     <description>Lock Region 41</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_42</name>
                     <description>Lock Region 42</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_43</name>
                     <description>Lock Region 43</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_44</name>
                     <description>Lock Region 44</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_45</name>
                     <description>Lock Region 45</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_46</name>
                     <description>Lock Region 46</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_47</name>
                     <description>Lock Region 47</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_48</name>
                     <description>Lock Region 48</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_49</name>
                     <description>Lock Region 49</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_50</name>
                     <description>Lock Region 50</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_51</name>
                     <description>Lock Region 51</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_52</name>
                     <description>Lock Region 52</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_53</name>
                     <description>Lock Region 53</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_54</name>
                     <description>Lock Region 54</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_55</name>
                     <description>Lock Region 55</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_56</name>
                     <description>Lock Region 56</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_57</name>
                     <description>Lock Region 57</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_58</name>
                     <description>Lock Region 58</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_59</name>
                     <description>Lock Region 59</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_60</name>
                     <description>Lock Region 60</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_61</name>
                     <description>Lock Region 61</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_62</name>
                     <description>Lock Region 62</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_REGION_63</name>
                     <description>Lock Region 63</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
